In [20]:
import pandas as pd

In [21]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [22]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [23]:
# standerdizing the data format
df['date'] =  pd.to_datetime(df['date'], errors='coerce')

In [24]:
df['date'].head(
    
)

0   2021-12-01
1          NaT
2          NaT
3          NaT
Name: date, dtype: datetime64[ns]

# Filling the null value with the date `2021-12-01`

In [25]:
df['date'] = pd.to_datetime(df['date'].fillna('2021-12-01'))

# Harmonize the name of the country

In [ ]:
# first way
df['country'] = df['country'].replace({
    'U.S.A.': 'USA',
    'America': 'USA',
    'United States': 'USA'
})

In [28]:
# second way
mapping_country = { 'U.S.A.': 'USA',
                    'America': 'USA',
                    'United States': 'USA'}

df['country'] = df['country'].replace(mapping_country)

In [29]:
df.head()

        date country    name  sales_2020  sales_2021
0 2021-12-01     USA  Aammar       100.0         NaN
1 2021-12-01     USA   Amaar       200.0       150.0
2 2021-12-01     USA   Hamza         NaN       300.0
3 2021-12-01     USA   Hazma       200.0       150.0

In [31]:
# Correct the typographical mistake in name
name_change = {'Amaar': 'Aammar', 'Hazma':"Hamza" }
df['name'] = df['name'].replace(name_change)

In [32]:
df.head()

        date country    name  sales_2020  sales_2021
0 2021-12-01     USA  Aammar       100.0         NaN
1 2021-12-01     USA  Aammar       200.0       150.0
2 2021-12-01     USA   Hamza         NaN       300.0
3 2021-12-01     USA   Hamza       200.0       150.0